Repository: coyotte508/cutting-fabric
Catalog: lib/l10n/app_*.arb
Languages: fr

# appTitle
source: Cutting Fabric
fr: Coupe Tissu

# appBarTitle
source: Cutting Plans for Fabric
fr: Plans de coupe pour tissu

# defaultPanelName
source: Cut {index}
fr: Découpe {index}

# defaultFabricName
source: Amazing Fabric
fr: Super tissu

# fabricCardTitle
source: Fabric "{name}"
fr: Tissu "{name}"

# fabricCardSubtitle
source: Fabric details
fr: Caractéristiques du tissu

source: Fabric name
fr: Nom du tissu

source: Fabric width
fr: Largeur du tissu

# fabricPricePerMeter
source: Price per meter
fr: Prix au mètre

source: Pattern
fr: Motif

source: With pattern
fr: Avec motif

source: Pattern width
fr: Largeur du motif

source: Pattern length
fr: Longueur du motif

# panelCardTitle
source: Cuts
fr: Découpes

# panelName
source: Cut name
fr: Nom de la découpe

# panelWidth
source: Cut width
fr: Largeur de la découpe

# panelLength
source: Cut length
fr: Longueur de la découpe

# panelQuantity
source: Number of cuts
fr: Nombre de découpes

# panelCenterOnPattern
source: Center on pattern
fr: Centrer sur le motif

# panelAllowRotation
source: Allow rotation
fr: Autoriser la rotation

# panelTableName
source: Name
fr: Nom

# panelTableMeasurements
source: Measurements
fr: Dimensions

# panelTableQuantity
source: Qty
fr: Qté

# editCTA
source: Edit
fr: Modifier

# addCTA
source: Add
fr: Ajouter

# showPattern
source: Show pattern on cutting plan
fr: Afficher le motif sur le plan de coupe

# launchAlgorithmCTA
source: Launch cutting algorithm
fr: Lancer l''algorithme de découpe

# noPattern
source: None
fr: Aucun

# yesCTA
source: Yes
fr: Oui

# noCTA
source: No
fr: Non

# deletePanelTitle
source: Delete cut
fr: Supprimer la découpe

# deletePanelMessage
source: Are you sure you want to delete the cut "{name}"?
fr: Voulez-vous vraiment supprimer la découpe "{name}" ?

# cuttingPlanDetailsMessage
source: Total price : {price} â‚¬ for {length} m of fabric
fr: Prix total : {price} € pour {length} m de tissu

# saveCTA
source: Save
fr: Enregistrer

# tooltipAllowRotation
source: Allow rotation
fr: Rotation autorisée

# tooltipCenterOnPattern
source: Center on pattern
fr: Centrer sur motif

# tooltipAllowRotationNo
source: Do not rotate
fr: Rotation bloquée

# tooltipCenterOnPatternNo
source: Do not center on pattern
fr: Ne pas centrer sur motif
